In [1]:
from sqlalchemy import create_engine
from dburl import db_url
import pandas as pd
engine = create_engine(db_url)
connection = engine.connect()
salary_data = pd.read_sql("Select * from salaries", connection)
title_data = pd.read_sql("Select * from titles", connection)
salary_data.head()

   emp_no  salary   from_date     to_date
0   10001   60117  1986-06-26  1987-06-26
1   10002   65828  1996-08-03  1997-08-03
2   10003   40006  1995-12-03  1996-12-02
3   10004   40054  1986-12-01  1987-12-01
4   10005   78228  1989-09-12  1990-09-12

In [3]:
title_data.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [8]:
merged_df = pd.merge(salary_data, title_data, on="emp_no", how ="inner")
merged_df = merged_df.drop(columns= ["from_date_x", "to_date_x", "from_date_y", "to_date_y"])
merged_df

        emp_no  salary            title
0        10001   60117  Senior Engineer
1        10002   65828            Staff
2        10003   40006  Senior Engineer
3        10004   40054         Engineer
4        10004   40054  Senior Engineer
...        ...     ...              ...
443303  499997   49597         Engineer
443304  499997   49597  Senior Engineer
443305  499998   40000     Senior Staff
443306  499998   40000            Staff
443307  499999   63707         Engineer

[443308 rows x 3 columns]

In [15]:
title_grouped_df = merged_df.groupby("title")